Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The data chunk and "eof" flag passed to the downstream Nginx output filters can also be overridden by assigning values directly to the corresponding table elements.
zh_cn: 发往下游Nginx输出过滤器的数据块和 "eof" 标记可以通过对表中相应元素的直接赋值来进行修改。

source: The default number of entries allowed is 1024 and when this limit is reached, new regular expressions will not be cached (as if the <code>o</code> option was not specified) and there will be one, and only one, warning in the <code>error.log</code> file:
zh_cn: 默认的条数是1024，当达到这个上限时，新的正则表达式将不被缓存 (就象没有设置 <code>o</code> 一样) ，同时在 <code>error.log</code> 文件中会记录一条且仅记录一条warning:

source: The default setting is <code>60s</code>.
zh_cn: 默认值是 <code>60s</code>.

source: The default time unit is <code>s</code>, i.e., "second".
zh_cn: 默认的时间单位是 <code>s</code>, 即, "秒".

source: The dollar sign characters in the return value of the <code>replace</code> function argument are not special at all.
zh_cn: 用作 <code>replace</code> 函数参数的[[#ngx.re.matchngx.re.match]]返回值中的美元符并不是特殊字符.

source: The effect in action:
zh_cn: 看看结果

source: The first argument to this method must be the dictionary object itself, for example,
zh_cn: 这个方法的第一个参数必须是字典对象本身, 例如,

source: The first argument, <code>delay</code>, specifies the delay for the timer, in seconds.
zh_cn: 第一个参数, <code>delay</code>, 指定定时器的延迟, 单位是秒.

source: The first optional argument, <code>timeout</code>, can be used to specify the maximal idle timeout (in milliseconds) for the current connection.
zh_cn: 第一个可选参数, <code>timeout</code>, 可以用来指定当前连接的最大空闲时间 (毫秒) .

source: The following dependencies are required to run the test suite:
zh_cn: 要运行测试包需要以下依赖:

source: The following example demonstrates parallel requests to MySQL, Memcached, and upstream HTTP services in a single Lua handler, and outputting the results in the order that they actually return (very much like the Facebook BigPipe model):
zh_cn: 下面的例子演示了在一个Lua处理器中对 MySQL, Memcached, 和上游HTTP 服务的并行请求, 结果按实际返回的次序输出 (非常象Facebook BigPipe 模型):

source: The following example demonstrates the use of <code>ngx.thread.wait</code> and [[#ngx.location.capture|ngx.location.capture]] to emulate [[#ngx.location.capture_multi|ngx.location.capture_multi]]:
zh_cn: 下面的例子演示了用 <code>ngx.thread.wait</code> 和 [[#ngx.location.capture|ngx.location.capture]] 来模拟 [[#ngx.location.capture_multi|ngx.location.capture_multi]]:

source: The following example demonstrates the use of coroutine.yield() in the "light thread" coroutines to do manual time-slicing:
zh_cn: 下面的例子演示了使用"轻量线程" coroutine.yield() 来实现手动分时:

source: The following example emulates the <code>$request_time</code> variable value (provided by [[HttpLogModule]]) in pure Lua:
zh_cn: 下面的例子用纯Lua代码模拟 <code>$request_time</code> 变量的值 (由 [[HttpLogModule]] 提供) in pure Lua:

source: The following message will be generated if PCRE JIT is enabled:
zh_cn: 如果打开了PCRE JIT，将出现以下信息:

source: The following methods are supported on this object:
zh_cn: 该对象支持以下方法:

source: The following option characters are supported:
zh_cn: 支持以下选项:

source: The following options are supported:
zh_cn: 支持以下选项:

source: The following patterns are supported:
zh_cn: 支持以下模式:

source: The format for the Lua table passed as the <code>args</code> argument is identical to the format used in the [[#ngx.encode_args|ngx.encode_args]] method.
zh_cn: <code>args</code> 参数Lua table的格式与 [[#ngx.encode_args|ngx.encode_args]] 所使用的table格式一样.

source: The header names are matched case-insensitively.
zh_cn: 头名称的匹配是大小写无关的.

source: The input argument <code>data</code> can either be a Lua string or a (nested) Lua table holding string fragments.
zh_cn: 输入参数 <code>data</code> 可以是 Lua 字符串或存有字符串片段的 (嵌套) Lua table.

source: The input data chunk is passed via [[#ngx.arg|ngx.arg]][1] (as a Lua string value) and the "eof" flag indicating the end of the response body data stream is passed via [[#ngx.arg|ngx.arg]][2] (as a Lua boolean value).
zh_cn: 输入参数块由 [[#ngx.arg|ngx.arg]][1] (作为Lua string)传入， 标记标识响应体数据流结束的"eof"由 [[#ngx.arg|ngx.arg]][2] (作为Lua boolean)传入.

source: The iterator function behaves differently (i.e., like a real iterator) when it is called with a <code>size</code> argument.
zh_cn: 如果带有<code>size</code>参数， iterator函数的行为略有不同 (象一个真正的iterator) .

source: The iterator function can be called multiple times and can be mixed safely with other cosocket method calls or other iterator function calls.
zh_cn: iterator函数可以多次调用，并且可以安全地与其它cosocket方法或其它iterator函数混合调用.

source: The iterator function will be reset after the last successful invocation that returns <code>nil</code> data and <code>nil</code> error.
zh_cn: 在最后一次成功返回<code>nil</code>数据和<code>nil</code>错误后，iterator函数将被重置。

source: The key must already exist in the dictionary, otherwise it will return <code>nil</code> and <code>"not found"</code>.
zh_cn: 键必须在字典中已经存在，否则返回 <code>nil</code> 和 <code>"not found"</code>.

source: The limit can be manually modified if required by editing the definition of the <code>NGX_HTTP_MAX_SUBREQUESTS</code> macro in the <code>nginx/src/http/ngx_http_request.h</code> file in the Nginx source tree.
zh_cn: 可以手工修改Nginx代码树中的<code>nginx/src/http/ngx_http_request.h</code>文件中的 <code>NGX_HTTP_MAX_SUBREQUESTS</code> 宏定义来修改这个上限。

source: The line is terminated by a <code>Line Feed</code> (LF) character (ASCII 10), optionally preceded by a <code>Carriage Return</code> (CR) character (ASCII 13).
zh_cn: 每一行以 <code>换行</code> (LF) 符(ASCII 10)（之前可能有一个 <code>回车</code> (CR) 符(ASCII 13)）结束.

source: The maximal number of pending timers allowed in an Nginx worker is constrolled by the [[#lua_max_pending_timers|lua_max_pending_timers]] directive.
zh_cn: Nginx worker中等待中的定时器最大数目由 [[#lua_max_pending_timers|lua_max_pending_timers]]命令控制.

source: The maximal number of running timers is controlled by the [[#lua_max_running_timers|lua_max_running_timers]] directive.
zh_cn: 运行中的定时器最大数目由 [[#lua_max_running_timers|lua_max_running_timers]]命令控制.

source: The module provides the full flexibility of scripting while offering performance levels comparable with native C language programs both in terms of CPU time as well as memory footprint.
zh_cn: 本模块提供了脚本语言的全部灵活性，以及无论在CPU时间上还是在内存消耗上都与C语言程序相匹敌的高性能.

source: The ngx_lua module does not currently support the <code>stat</code> mode available with the Apache <code>mod_lua</code> module but this is planned for implementation in the future.
zh_cn: ngx_lua 模块目前不支持Apache <code>mod_lua</code> module 中有的 <code>stat</code> 模式，但我们计划在将来实现它。

source: The number <code>8</code> will be consistently output when accessing <code>/get</code> regardless of how many Nginx workers there are because the <code>dogs</code> dictionary resides in the shared memory and visible to ''all'' of the worker processes.
zh_cn: 不管有多少个Nginx worker进程，访问<code>/get</code>时每次都输出 <code>8</code> 是因为 <code>dogs</code> 字典位于共享内存中，对 ''所有'' worker进程可见。

source: The optional <code>exptime</code> argument specifies expiration time (in seconds) for the inserted key-value pair.
zh_cn: 可选参数 <code>exptime</code> 指定插入的key-value对的过期时间 (单位是秒).

source: The optional <code>flags</code> argument specifies a user flags value associated with the entry to be stored.
zh_cn: 可选的 <code>flags</code> 参数是与被插入的项相关的用户标志。

source: The optional <code>max_args</code> argument can be used to specify the maximum number of arguments parsed from the <code>str</code> argument.
zh_cn: 可选的<code>max_args</code> 参数指定从 <code>str</code> 解析出的参数数量的上限.

source: The optional <code>options</code> argument has exactly the same meaning as in [[#ngx.re.match|ngx.re.match]].
zh_cn: 可选参数 <code>options</code> 与 [[#ngx.re.match|ngx.re.match]] 中的语义一致.

source: The optional <code>options</code> argument takes exactly the same semantics as the [[#ngx.re.match|ngx.re.match]] method.
zh_cn: 可选的<code>options</code>参数与 [[#ngx.re.match|ngx.re.match]] 方法中的参数语义完全一致。

source: The optional <code>status</code> parameter specifies whether <code>301</code> or <code>302</code> to be used.
zh_cn: 可选的 <code>status</code> 参数指定使用 <code>301</code> 还是 <code>302</code> 。

source: The optional boolean <code>jump</code> argument can trigger location rematch (or location jump) as [[HttpRewriteModule]]'s [[HttpRewriteModule#rewrite|rewrite]] directive, that is, when <code>jump</code> is <code>true</code> (default to <code>false</code>), this function will never return and it will tell Nginx to try re-searching locations with the new URI value at the later <code>post-rewrite</code> phase and jumping to the new location.
zh_cn: 可选的boolean参数 <code>jump</code> 可以象 [[HttpRewriteModule]] 的 [[HttpRewriteModule#rewriterewrite]] 命令一样触发location重匹配 (或称location跳转) , 如果 <code>jump</code> 是 <code>true</code> (默认为<code>false</code>), 这个函数将不会返回，而是告诉 Nginx 在后面的<code>post-rewrite</code>阶段尝试重新对新的URI值进行location匹配并中转到新的location.

source: The optional fourth argument, <code>ctx</code>, can be a Lua table holding an optional <code>pos</code> field.
zh_cn: 第4个可选参数, <code>ctx</code>, 是装有 <code>pos</code> 值的Lua table.

source: The optional second <code>args</code> can be used to specify extra URI query arguments, for example:
zh_cn: 可选的第二个参数 <code>args</code> 可用于指定额外的 URI 请求参数, 例如:

source: The order in which these modules are added during configuration is important as the position of any filter module in the filtering chain determines the final output.
zh_cn: 这些模块在配置中的添加次序是重要的，因为过滤器链中任何过滤器模块的位置都将对最终输出产生影响.

source: The output data stream can be aborted immediately by running the following Lua statement:
zh_cn: 可以用过执行下面的Lua语句来立即终止响应数据流:

source: The packages can be introduced into external Lua modules like this:
zh_cn: 它们可以象这样被引入到外部 Lua 模块中:

source: The parameter <code>sec</code> is the time stamp in seconds (like those returned from [[#ngx.time|ngx.time]]).
zh_cn: <code>sec</code>参数是以秒为单位的时间戳 (同 [[#ngx.time|ngx.time]] 的返回值).

source: The path string is in standard Lua path form, and <code>;;</code> can be used to stand for the original search paths.
zh_cn: 路径字符串使用标准的Lua路径格式，, <code>;;</code>可用于表示原始的查找路径。

source: The possibilities are unlimited as the module allows bringing together various elements within Nginx as well as exposing the power of the Lua language to the user.
zh_cn: 本模块允许将Nginx内部的不同元素放到一起并且将Lua语言的强大赋予了用户，拥有无限的可能性.

source: The raw binary form of the <code>HMAC-SHA1</code> digest will be generated, use [[#ngx.encode_base64|ngx.encode_base64]], for example, to encode the result to a textual representation if desired.
zh_cn: 此函数返回的是 <code>HMAC-SHA1</code> 文摘的二进制数据，如果需要，可以使用[[#ngx.encode_base64|ngx.encode_base64]]将其转成文本形式。

source: The regular expressions used in [[#ngx.re.match|ngx.re.match]], [[#ngx.re.gmatch|ngx.re.gmatch]], [[#ngx.re.sub|ngx.re.sub]], and [[#ngx.re.gsub|ngx.re.gsub]] will be cached within this cache if the regex option <code>o</code> (i.e., compile-once flag) is specified.
zh_cn: [[#ngx.re.match|ngx.re.match]], [[#ngx.re.gmatch|ngx.re.gmatch]], [[#ngx.re.sub|ngx.re.sub]], and [[#ngx.re.gsub|ngx.re.gsub]]中使用的正则表达式，如果设置了 <code>o</code> (即“仅编译一次”）模式，将在这个缓存中进行缓存。

source: The request body data read using this function can be retrieved later via [[#ngx.req.get_body_data|ngx.req.get_body_data]] or, alternatively, the temporary file name for the body data cached to disk using [[#ngx.req.get_body_file|ngx.req.get_body_file]].
zh_cn: 使用此函数读取的请求体数据也可以延后，通过 [[#ngx.req.get_body_data|ngx.req.get_body_data]] 读取，或使用缓存的磁盘的临时文件名[[#ngx.req.get_body_filengx.req.get_body_file]]进行读取.

source: The result is exactly the same as [[#ngx.crc32_long|ngx.crc32_long]].
zh_cn: 结果与 [[#ngx.crc32_long|ngx.crc32_long]] 一样.

source: The result is exactly the same as [[#ngx.crc32_short|ngx.crc32_short]].
zh_cn: 结果与 [[#ngx.crc32_short|ngx.crc32_short]] 一样.

source: The result is exactly the same as the previous example.
zh_cn: 结果与上一个例子完全一样.

source: The resulting object <code>dict</code> has the following methods:
zh_cn: 返回的 <code>dict</code> 对象有以下方法:

source: The return values have exactly the same meaning as [[#coroutine.resume|coroutine.resume]], that is, the first value returned is a boolean value indicating whether the "light thread" terminates successfully or not, and subsequent values returned are the return values of the user Lua function that was used to spawn the "light thread" (in case of success) or the error object (in case of failure).
zh_cn: 返回值的意思与 [[#coroutine.resume|coroutine.resume]] 的返回值完全一样, 即, 第一个返回值是表明"轻量线程"是否成功结束的布尔值，后面的值是用来派生出"轻量线程"的Lua函数的返回值(成功的情况)或错误对象（出错的情况）.

source: The returned file is read only and is usually cleaned up by Nginx's memory pool.
zh_cn: 返回的文件是只读的，通常由Nginx的内存池来清理.

source: The right way of doing this is as follows:
zh_cn: 正确的作法是这样的:

source: The same applies to assigning an empty table:
zh_cn: 设置成一个空table的效果是一样的:

source: The second argument, <code>callback</code>, can be any Lua function, which will be invoked later in a background "light thread" after the delay specified.
zh_cn: 第二个参数, <code>callback</code>, 可以是任何Lua函数，在指定的延迟时间后被后台的"轻量线程"调用.

source: The second optional argument, <code>size</code>, can be used to specify the maximal number of connections allowed in the connection pool for the current server (i.e., the current host-port pair or the unix domain socket file path).
zh_cn: 第二个可选参数, <code>size</code>, 可以用来指定当前服务器(当前的主机-端口对，或 unix domain socket文件路径)连接池中的最大连接数.

source: The shared dictionary will retain its contents through a server config reload (either by sending the <code>HUP</code> signal to the Nginx process or by using the <code>-s reload</code> command-line option).
zh_cn: 这部分共享字典的内容即使在服务器重新加载配置时(通过向Nginx进程发送 <code>HUP</code> 信号或者使用 <code>-s reload</code> 命令行参数)仍能保持.

source: The socket object returned by this method is usually used to read the current request's body in a streaming fashion.
zh_cn: 此方法返回的socket对象通常用来以流的方式读取当前请求的体。

source: The status of the "light thread" coroutine can be "zombie" if # the current "light thread" already terminates (either successfully or with an error), # its parent coroutine is still alive, and # its parent coroutine is not waiting on it with [[#ngx.thread.wait|ngx.thread.wait]].
zh_cn: "轻量线程" coroutine 在下面的情况下可能成为 "僵尸" # 当前 "轻量线程" 已经结束 (成功或者出错), # 父corotine仍然活着，而且 # 父coroutine没有用 [[#ngx.thread.wait|ngx.thread.wait]] 等待它.

source: The support for the options table argument was first introduced in the <code>v0.5.7</code> release.
zh_cn: 这个可选的table参数在 <code>v0.5.7</code> 版本中引入.

source: The table keys must be Lua strings.
zh_cn: table的key必须是 Lua 字符串.

source: The time resolution is <code>0.001</code> seconds.
zh_cn: 时间精度为 <code>0.001</code> 秒.

source: The total latency is the longest latency of the individual subrequests rather than the sum.
zh_cn: 总的延迟是各个子请求延时的最大值，而不是它们的和.

source: The upper limit of the regex cache can be tuned via the [[#lua_regex_cache_max_entries|lua_regex_cache_max_entries]] directive.
zh_cn: 可以使用[[#lua_regex_cache_max_entrieslua_regex_cache_max_entries]]来调整正则缓存的上限.

source: The usage of this function is often like this:
zh_cn: 这个函数的用法通常是这样的:

source: The user callback will be called automatically by the Nginx core with the arguments <code>premature</code>, <code>user_arg1</code>, <code>user_arg2</code>, and etc, where the <code>premature</code> argument takes a boolean value indicating whether it is a premature timer expiration or not, and <code>user_arg1</code>, <code>user_arg2</code>, and etc, are those (extra) user arguments specified when calling <code>ngx.timer.at</code> as the remaining arguments.
zh_cn: 用户回调函数将被Nginx核心自动调用，调用参数为<code>premature</code>, <code>user_arg1</code>, <code>user_arg2</code>, 等, 其中 <code>premature</code> 参数是布尔值，表示是否是过早的定时器过期, <code>user_arg1</code>, <code>user_arg2</code>, 等是调用<code>ngx.timer.at</code>时指定的那些参数.

source: The user flags argument was first introduced in the <code>v0.5.0rc2</code> release.
zh_cn: 用户标记参数在 <code>v0.5.0rc2</code> 版本中引入。

source: The user flags is stored as an unsigned 32-bit integer internally.
zh_cn: 用户标记在实现上是以无符号 32位整数存储的.

source: The value returned will have the original data type when they were inserted into the dictionary, for example, Lua booleans, numbers, or strings.
zh_cn: 返回的值拥有其被写入字典时同样的数据类型，例如, Lua 布尔值, 数字, 或字符串.

source: Their value type will also be stored into the dictionary and the same data type can be retrieved later via the [[#ngx.shared.DICT.get|get]] method.
zh_cn: 类型信息也会被存入字典，这样后续调用[[#ngx.shared.DICT.getget]]时可以取出同样类型的数据.

source: Then <code>GET /main</code> will give the output
zh_cn: <code>GET /main</code> 将输出

source: Then <code>GET /orig</code> will give
zh_cn: <code>GET /orig</code> 的结果

source: Then <code>GET /t</code> will just return the output
zh_cn: 请求 <code>GET /t</code> 将产生以下输出

source: Then <code>GET /test</code> will yield the output
zh_cn: <code>GET /test</code> 的输出如下

source: Then <code>GET /test?foo=bar&bar=baz&bar=blah</code> will yield the response body
zh_cn: <code>GET /test?foo=bar&bar=baz&bar=blah</code> 的结果是响应体

source: Then <code>res.header["Set-Cookie"]</code> will be evaluated to the table value <code>{"a=3", "foo=bar", "baz=blah"}</code>.
zh_cn: 那么 <code>res.header["Set-Cookie"]</code> 的值是table <code>{"a=3", "foo=bar", "baz=blah"}</code>.

source: Then for the incoming data stream <code>'hello, world!
zh_cn: 对于输入数据流 <code>'hello, world!

source: Then for the input data stream <code>"hello world _END_ blah blah blah"</code>, then the example above will output <code>hello world _END_</code>, including the pattern string <code>_END_</code> itself.
zh_cn: 对于输入数据流 <code>"hello world _END_ blah blah blah"</code>, 上面的例子将输出 <code>hello world _END_</code>, 包括模式串<code>_END_</code> 本身.

source: Then it will generate the output
zh_cn: 将会生成这样的输出

source: Then request <code>GET /lua</code> gives
zh_cn: 请求 <code>GET /lua</code> 得到

source: Then, enable the "debug" error log level in <code>error_log</code> directive.
zh_cn: 然后在<code>error_log</code>命令中打开 "debug" 错误日志级别.

source: There is a hard coded <code>2048</code> byte limitation on error message lengths in the Nginx core.
zh_cn: Nginx 内核中硬编码限制了错误信息长度为 <code>2048</code> 字节.

source: There is a hard-coded upper limit on the number of concurrent subrequests possible for every main request.
zh_cn: 对每个主请求，对同时并发的子请求的数量有一个硬编码的上限。

source: There is no way to use the [[#tcpsock:settimeout|settimeout]] method to specify connecting timeout for this method and the [[#lua_socket_connect_timeout|lua_socket_connect_timeout]] directive must be set at configure time instead.
zh_cn: 不能使用 [[#tcpsock:settimeout|settimeout]] 来设置本方法的连接超时，必须用 [[#lua_socket_connect_timeout|lua_socket_connect_timeout]] 命令在配置阶段设置.

source: These variables are set after the sharing or copying of variables has been evaluated, and provides a more efficient method of passing specific values to a subrequest over encoding them as URL arguments and unescaping them in the Nginx config file.
zh_cn: 这些变量的设置发生在共享或拷贝的变量被求值以后， 这样提供了一种比将参数编码成URL参数并在Nginx配置文件中对它们进行反转义更高效的传递参数的方法。

source: These constants are usually used by the [[#ngx.log|ngx.log]] method.
zh_cn: 这些常量通常被用在 [[#ngx.log|ngx.log]] 方法中.

source: These constants are usually used in [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]] method calls.
zh_cn: 这些常量多用于 [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]] 调用.

source: These options can be combined:
zh_cn: 以上选项可以组合使用:

source: These packages are in the default global scope within ngx_lua and are always available within ngx_lua directives.
zh_cn: 这两个包在ngx_lua模块的默认全局作用域中， 在ngx_lua命令里总是可以访问到.

source: These two forms are fundamentally equivalent.
zh_cn: 这两种形式本质上是一样的.

source: This API requires the OpenSSL library enabled in the Nginx build (usually by passing the <code>--with-http_ssl_module</code> option to the <code>./configure</code> script).
zh_cn: 本API需要在编译Nginx时打开OpenSSL库 (<code>./configure</code>命令加上 <code>--with-http_ssl_module</code> 选项).

source: This API was first enabled in the <code>v0.6.0</code> release.
zh_cn: 此API在 <code>v0.6.0</code> 版本中引入.

source: This API was first enabled in the <code>v0.7.0</code> release.
zh_cn: 本命令在 <code>v0.7.0</code> 版本中引入.

source: This API was first introduced in <code>v0.3.1rc32</code>.
zh_cn: 本命令在 <code>v0.3.1rc32</code> 版本中引入.

source: This API was first introduced in ngx_lua v0.3.1rc6.
zh_cn: 本命令在 <code>v0.3.1rc6</code> 版本中引入.

source: This API was first introduced in the <code>v0.3.1rc8</code> release.
zh_cn: 本命令在 <code>v0.3.1rc8</code> 版本中引入.

source: This API was first introduced in the <code>v0.5.10</code> release.
zh_cn: 本命令在 <code>v0.5.10</code> 版本中引入.

source: This API was first introduced in the <code>v0.6.0</code> release.
zh_cn: 此API在 <code>v0.6.0</code> 版本中引入.

source: This API was first introduced in the <code>v0.7.4</code> release.
zh_cn: 此API在 <code>v0.7.4</code> 版本中引入.

source: This API was first introduced in the <code>v0.8.0</code> release.
zh_cn: 此API在 <code>v0.8.0</code> 版本中引入.

source: This allows named
zh_cn: 此选项允许具名

source: This also applies to [[#access_by_lua|access_by_lua]] and [[#access_by_lua_file|access_by_lua_file]].
zh_cn: 这也适用于 [[#access_by_lua|access_by_lua]] 和 [[#access_by_lua_file|access_by_lua_file]].

source: This argument can be set to zero to remove the limit and to process all request arguments received:
zh_cn: 这个参数设成0表示无上限，会处理接收到的所有的请求参数：

source: This argument can be set to zero to remove the limit and to process all request headers received:
zh_cn: 这个参数设成0表示无上限，会处理接收到的所有的请求头：

source: This buffer does not have to be that big to hold everything at the same time because cosocket supports 100% non-buffered reading and parsing.
zh_cn: 这个缓冲区不需要大于能够一次装下所有的东西，因为 cosocket 支持 100% 无缓冲读取和解析.

source: This buffering mechanism is mainly used for HTTP 1.0 keep-alive which replies on a proper <code>Content-Length</code> response header.
zh_cn: 这个缓冲机制主要用于HTTP 1.0 keep-alive，基于正确的 <code>Content-Length</code> 响应头.

source: This call involves a syscall and thus has some overhead, so do not abuse it.
zh_cn: 这个函数包括一个系统调用，有一定的开销，请勿滥用。

source: This can be particularly useful for streaming output.
zh_cn: 这在做流式输出时特别有用.

source: This can be striped out by specifying the <code>-s</code> option as shown:
zh_cn: 可以用 <code>-s</code> 选项去掉调试信息:

source: This constant was first introduced in the <code>v0.5.0rc5</code> release.
zh_cn: 此常量在 <code>v0.5.0rc5</code> 版本中引入.

source: This data sharing technique is essential for high performance Lua applications based on this module.
zh_cn: 这种数据共享技术对于使用本模块的高性能Lua应用是至关重要的.

source: This depends on
zh_cn: 这取决于

source: This directive can be freely mixed with all directives of the [[HttpRewriteModule]], [[HttpSetMiscModule]], and [[HttpArrayVarModule]] modules.
zh_cn: 这条命令可以随意与 [[HttpRewriteModule]], [[HttpSetMiscModule]], 和[[HttpArrayVarModule]] 模块中的命令混合使用.

source: This directive can be used to toggle error logging when a failure occurs for the TCP or UDP cosockets.
zh_cn: 本命令可以用来打开/关闭TCP或UDP cosocket出错时的错误日志。

source: This directive controls the default maximal idle time of the connections in the cosocket built-in connection pool.
zh_cn: 本命令控制cosocket内置连接池中连接的默认最大空闲时间。

source: This directive controls the default timeout value used in TCP/unix-domain socket object's [[#tcpsock:connect|connect]] method and can be overridden by the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 本命令控制 TCP/unix-domain socket 对象[[#tcpsock:connect|connect]] 方法中使用的默认超时时间， 可以用 [[#tcpsock:settimeout|settimeout]] 方法进行修改.

source: This directive controls the default timeout value used in TCP/unix-domain socket object's [[#tcpsock:receive|receive]] method and iterator functions returned by the [[#tcpsock:receiveuntil|receiveuntil]] method.
zh_cn: 本命令控制 TCP/unix-domain socket 对象[[#tcpsock:receive|receive]] 方法中使用的默认超时时间， 可以用 [[#tcpsock:settimeout|settimeout]] 方法进行修改.

source: This directive controls whether to check for premature client connection abortion.
zh_cn: 本命令控制是否检测客户端连接过早中断。
